#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```module.keycloak_prod.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a08293fc-5476-4ac3-acf5-1d6ac4857080/30f3863c-d4eb-4478-bbaf-d88828fa38d6]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/2c747be3-cc7b-4b90-9393-fa72a91782e8]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2f17b858-36ba-4836-9837-18c67dc494be/c606772c-5ed6-4d9e-bd1f-59ad99df8a9d]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/f0eb3cf1-9df1-4c0d-a243-30b310ea25fc]
module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=58417bb9-4aca-4b90-8a27-a2cdb8b35d98/c5217361-6414-4a31-ac42-3c98b8374375]
module.keycloak_prod.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=676d98ef-3fb1-4908-a953-00f716ca4cb9/433913cf-a4d1-4817-b30f-defd56f4b732]
module.keycloak_prod.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=prime/884041c4-228c-46ba-8d9d-6c2174aee417]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/c60691ec-50fb-4e9c-87c3-add222813f56]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6a18f07d-8162-4421-857c-9ec274a6a15e/82c8a9b1-8937-4cb2-99d9-dafaedc5d676]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/3e40aad2-428f-453f-a88c-9230d9108b71]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7303c437-2799-42bf-b402-ca257df3190b/78221f62-242f-4db5-bd10-8e88024f2202]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=dd266a6c-e839-4d80-851f-de9b9a534a60/c3646b5c-9ca6-4ba4-a1ca-41a3c9301bb4]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/2f8babc1-f08e-4ee4-8496-9dde30ba8ba0]
module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=20924d66-6495-4f9f-9ac2-acd41d3f35c8/ae162d78-aae4-4557-b847-0811d780b21b]
module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/d9344701-b5b6-4c61-9145-27c8bd0c31ce]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/a0fbe634-a2c6-45ce-bf62-551d75d57276]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=daebaad1-7c55-4d12-8f7b-6345dcb00c6b/ecad59c1-159d-42ac-9506-acab6152f710]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=be1d85eb-b8c7-4d84-a58a-b7ccdb3d4020/40410dcd-a040-49db-93e9-8b27ff11c6f3]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/86b2128d-3ced-457a-8ea6-d2983a251d2f]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/7cda6de5-e8f2-43fb-a9d8-5a9764917b04]
module.keycloak_prod.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=d2b234b3-8438-4d27-9d10-7c2d0c2afe69/f54cbb09-023b-4d95-8184-a7c9a0480fd9]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9e0d7762-ab64-4a06-be87-bd5f20f9ad27/6b6fcce4-9898-4a59-a4f7-be79b4e1f4bd]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/79e953c0-56b3-4c41-b82e-febaeddf8238]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2391c9f6-dab9-4ce2-be99-5ac4a6507f2b/ec7f9402-bca4-4e23-abdf-7d638c9a48fd]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/6125e99f-17bc-481d-9b13-c41ca861dd90]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0cd3364c-8655-4bcd-9370-e7c3cf1d3ef2/62e32862-65e5-41a0-b251-8fcd4879a4ca]
module.keycloak_prod.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/7738dfb6-f35f-4130-bb50-b0939e2f74f4]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c0dfcd53-d607-4e14-8f3b-bd3471ed5d95]
module.keycloak_prod.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=67e9942a-31b4-481d-b9d3-0dfd91eb15b1/19f7edee-6468-4a0d-8424-863800a54b8f]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/aa16524f-c3e1-4f5d-8c1f-d110389da57a]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b941f2ed-c81f-48e0-bb1e-3ce6a3b77762/5c7c5d2b-0e8f-4e38-b9e3-70d9a866067e]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2ccc0aae-2b5f-4a28-b9e8-89e9e5dd526c/5ffe3cf4-06fd-4fc1-8967-4bd23305857b]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/ef21b696-c904-496a-b895-3d91c453556c]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c7e890ec-d904-4bb1-87cf-38f051e272b0]
module.keycloak_prod.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9e25e9a7-64a2-45d0-97df-1bcd40e16740/0bc5094b-0395-45f2-ba79-2d48adbb56d3]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/2136d6cb-13f9-4159-8d7f-d98eb1b6f179]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=24949860-0044-4ec3-ae9a-1c66596e9705/c21ecb4e-04eb-4e69-b507-904e6d0551f4]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/5e5101d4-3eac-43e0-a01e-6b18efb99283]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=47f68b75-a001-445f-a4ef-5b7a9830f9a7/cb2a598e-ab9b-438b-a34b-3bc7ab4e1bb6]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/25223477-962e-41e1-b9f5-daa75e9ccb84]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3bb01387-da9d-4ed5-a07c-73262f592c10/02372aeb-eb91-46c6-98d4-4355d0145e79]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=d930bf82-08c1-437f-8203-e642daa82003/5d206c8a-22f7-43e3-bc61-97206a4e6ee6]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/be2bd5b6-58a0-437d-b0b5-280ea6161e65]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e8c8fccd-7173-4e27-a385-082ac2bbd8b6/44ffbf96-9eb7-406c-a0f2-31f508c6950c]
module.keycloak_prod.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/f1a83d37-d855-4012-a1a1-346427c1fcc7]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e6d96a34-00a5-41d3-9593-5245ad98e23d/c840a96a-e9c9-495b-aed1-615d22a804d4]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=cda91640-812f-43d6-89cf-157649d110da/74c62da3-0579-45a3-99ee-d49a36342d65]
module.keycloak_prod.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/b7c5ca62-aea1-4048-b895-4c171bde994e]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/eafe733e-c725-451c-a7b1-ec4daff5c0e4]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/ab19fea3-e590-465f-bfa5-5ff2a56ed0c7]
module.keycloak_prod.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bb3431c2-3a0c-475d-8ab2-b58919edeab2/74003394-2fdb-47f9-b49b-48b63ebbf61c]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fff843cb-9373-40d3-9dde-c8d432bfba13]
module.keycloak_prod.module.custom_realms.module.social.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=922f7e74-a597-453a-b443-378264d3cea6/651a4acf-abe0-4827-ab44-1976ac819466]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/8a38efbb-4c75-4af0-8d48-8ec2f20884f3]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bdc9262c-c5ed-4104-b605-b1f8487efc24/c359625a-32ec-4c5a-9843-9f5f1b82873a]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6ef64086-8e8c-4feb-a94b-04e3cbfa8d1c]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6d73d7de-6824-4b40-852e-c769964eb3ee/e14041a8-874a-4bd5-8f06-91912def78b3]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/d38448a6-9d39-412d-82cd-0e47ca6f509c]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=109c38ca-c28f-4442-859c-333c5c32ef23/3a1ffbd1-8e64-448d-8196-b8daafc1d3ea]
module.keycloak_prod.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e9864725-fe6c-4c06-b8e1-3cb699092da4/edcbfa32-0432-489c-870a-26c0b513ff3d]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/4c2dec25-f5f2-4a0c-961b-001a78eb382c]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/fe53c0e1-1454-416b-b09d-47cdf60ecf1e]
module.keycloak_prod.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/7a8ce128-dd71-4211-b8b1-1094821e244c]
module.keycloak_prod.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f47282e-b20d-4dd4-9817-facf5ddd6102/faa01787-7412-4285-89fe-4a44b8bb9ca7]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5f634583-cd9a-4e68-a81b-8874cbdc21ff/2eee1419-877d-4640-9246-2f3b7c40a790]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/5d9a7fc8-60bf-4166-a17d-f9822e41ccae]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=edb8f481-79d7-4a5b-a0e7-8f434fa9788f/70b668f1-461c-4c0b-884e-2bee77e7fb26]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6064bcea-1e5a-4b90-afff-15e0a6164604]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=947e9768-f5db-4a66-b8f6-e5691ab74c8f/5e8e3dca-1c88-4b48-abe3-48e2d341d803]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/0be0212a-cd08-4438-b813-c37602958c13]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b5719a55-48d6-47ae-bd28-97879d9c7f2d/bf405a0f-cd3e-4590-9a1e-4fa98b94ae2a]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=349b1549-669e-41a4-9bd3-25967a5dae49/021e71ef-9525-4847-8f6b-41cadec94075]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/49553bd4-bfc5-49c6-bc79-a5cb1a7b92b1]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0799aeec-db43-4158-ab80-f24b4bc314fc/463e6fc1-1986-4cbd-96f6-71d4fc5a3483]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=42bfd77d-160c-4a33-bd9a-73ef27cb56f5/29709972-06ca-4768-868a-6a4cd64850ef]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/2638a446-f16c-493c-9f64-3887efb91097]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9f8056d9-a805-4d0c-a642-e7813bcd036c/676f448e-acf2-47c3-b14d-091a3d7f0e65]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/471158d3-e51f-42ac-b108-cefd32add1c6]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4366fa33-067f-487a-8de1-e212b7741167/3484e828-d4c4-4480-94ce-7efbc7db34ab]
module.keycloak_prod.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c42728f6-a3e5-4041-9554-64146cd0c334]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/a397fe17-c21f-47aa-9cfd-7140d6456fc5]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0714393e-229e-4b5a-8acb-20084416803e]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f859d391-81a7-4672-aaf4-f14de0161556/53dca544-2157-4f98-a9bb-d002f95b25a6]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c41b5db9-f3d9-4131-a035-5d5bf7354658/8ddebd37-3ccb-441b-8b91-0aec3231ea5d]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3fdfc6bd-0720-4e7b-be64-9a26c3254f3e/b2bd0a02-e8ad-4438-8d2d-a18a7cc511b6]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0bce3db9-32b7-4a02-9652-626527d0468d]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7a28a4a6-ac06-4160-8344-5ef71b45673d/e1c298c9-1512-4e80-8d70-cf1ae6e8d276]
module.keycloak_prod.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/bf8ca42d-02fc-43ec-a1ce-895dc21b873c]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=430dda76-e331-4902-8962-45bb54c051cc/7ed36227-ad0f-4329-8c1c-e00e5ad7ce1a]
module.keycloak_prod.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/2d81c57c-5c24-49f4-9189-a32653b64d8f]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=113f82c3-15ae-4c11-bc49-89ed1b19ceee/50ea9016-6f39-4bcd-9b67-8ca7d6d39c3d]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/fd3b0688-1de5-4c47-b097-357f0827d53c]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=11a4a1df-534e-4c92-a359-73a1e1677964/944b73eb-f21d-4ce6-a6e3-da1d2cf3adb1]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/53d9e0d0-1d40-4503-954a-75bd13ac7f21]
module.keycloak_test.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=prime/2364fd64-f95c-4ad4-8085-c57a6a7dc4de]
module.keycloak_test.module.custom_realms.module.prime.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a3811c14-b233-4bfa-b0e6-483f5a2165ab/574d6d45-603c-41e3-bf82-4439a6a4ccb0]
module.keycloak_test.module.custom_realms.module.prime.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=prime/106f81ce-9171-4d3b-bb8e-f8c72534227e]
module.keycloak_test.module.custom_realms.module.prime.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=550cf6b5-1e40-45a3-8022-6da933272c51/1cc204e6-6ca8-4d70-aa9c-18ff69d9ca99]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/143cc7b9-5fdf-4b3c-9529-6ae6f8da8e05]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=288f0655-4c3d-479c-9406-accd6903bd28/5114aa42-95cd-4b8a-ba5d-bcbdddc1ef70]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0a6feff7-cb98-48df-9e29-3b9f79610615/6f5e2b9f-f1e0-4e9a-b86f-fbef54f96ca8]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/a0880957-293d-4482-a708-ab0715db5a0e]
module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=097956c1-a5fe-4e87-9597-387f49da46f1/ef81f9a3-bbc2-49f0-88bd-4bd10c8960ab]
module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/5dcbd38a-9dc3-4254-aff2-dfd0fcbcaccb]
module.keycloak_test.module.custom_realms.module.social.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c95cbf08-cd0c-43c0-a178-cb222ad7a90b]
module.keycloak_test.module.custom_realms.module.social.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0c236b58-2c51-44f8-af25-fae254751555/43fe0783-5f40-4549-bebe-d1c95497fe04]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2ee2486b-9afb-4250-912f-7d009fd2b792/6207bdff-a92d-4e78-b22e-4d3b3cbd1807]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/e1b0a329-b964-4320-897b-5aaa031b100f]
module.keycloak_test.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/1dfc8d41-56c3-48e2-a676-4c5569d014b5]
module.keycloak_test.module.custom_realms.module.social.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0e1366bc-25d0-4f4f-91a8-a1cecdcbce2b/015763c8-2f90-4923-ae0d-7d316ab19b5a]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e59e26f2-0a90-478f-9863-7920afb72049/48c6fe30-aee8-40ed-8407-c5b2879dcb19]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=testing-nithin/c676aab3-6853-491a-ad88-14a0dcd280fd]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=8bc9c084-6e42-4634-99b8-a7cb68416a65/97677fb5-c82d-4ab7-96c7-264fc071b898]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/9e64b052-36ac-44dc-97e0-da394164c599]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=workbces/80658f0f-98ea-4cdc-b003-81cf47c6420d]
module.keycloak_test.module.custom_realms.module.workbces.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=a4085735-fdde-4659-8ad8-4d6e8d3ba853/adde8865-0354-4191-b297-ad20cacf6f8a]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=abef99e2-c70d-42b6-a52d-a413c51c1b8c/ccafae16-2917-41c9-b277-f027f07fc952]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/8853803a-8672-4387-99f5-c701fa315cb3]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=2363445b-3c08-4c49-9ac1-8b7ee3a7d7cc/22305ecb-c5e5-4bf9-b3d7-5381098b4436]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/50eb365e-1a82-4448-b292-d21fb13f6e3d]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0ff807d8-a3d4-49e8-bc2a-f18c5d9a438d/98751cc7-4fc3-490c-9e33-0b708f51fb40]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fe1eeaf4-8801-4b62-96e2-ea2792a71b6c]
module.keycloak_test.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=cf77735d-580e-4587-9b06-26d2e53362e2/7758136f-af25-4370-9d74-e9f05bf3e7f1]
module.keycloak_test.module.custom_realms.module.social.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=social/3c85578e-e3c1-4f78-971a-a034ea2afae0]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/13e4385a-d6c3-48d9-920b-ab944bb50215]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=112f8ca9-91c6-4be2-ab3e-4278e8fdaf21/00e0874c-c611-4b28-ae94-39517625830c]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=1e0981ae-f1e8-4394-b1de-91cd227da1f0/0ecdee26-5692-4b8c-b7ae-095d7d09f285]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/a06a71d0-b878-4955-b563-e3d4e7f942a8]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bdad6e42-5fc3-44c5-8bf9-3b2c54bebdc8/3547f437-efe4-4db7-b699-ef8d5f65c689]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/3cf290c4-4264-4cb8-a8f3-e3bba7d32cec]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6a8a6df5-524f-44a7-94c4-04c3835c479b/144eb7c4-387f-4189-9e0a-93543da2cee4]
module.keycloak_test.module.custom_realms.module.foi-mod.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/0e605b15-e1f5-4a01-9d9b-637df8c240a7]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/5025c582-7e0f-4ede-99fd-bb6d9fa284a4]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=87364162-e1e5-4974-aa33-ebc7def99e1c/9c4c9c06-15ec-4032-a44e-d0c9aa3b3a3d]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=moti-custom/3d0ccadf-0656-4cf5-a8e0-70298f66efed]
module.keycloak_test.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=340965d1-5a83-46a5-9ceb-4e71360d7b93/3054682c-2556-4a03-b89e-e3b407519321]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=746c937d-4492-4c3e-91e3-7dc355a5a701/81be272f-96a6-432b-9ec3-a1c48fc74e6f]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcparks-service-transformation/8cc66266-e7c9-49d0-9094-db8880d49bc5]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=5e85a20c-54d3-4fd0-af1c-43c3e66ffd42/a853cad0-568f-4ff8-b670-937e81e11b60]
module.keycloak_test.module.custom_realms.module.digitaltrust-citz.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-citz/ada52cde-eb69-45f4-b810-000050101314]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/67727a7d-7e9e-4e38-b009-72294b87f8ed]
module.keycloak_prod.module.custom_realms.module.foi-mod.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=foi-mod/ceca7803-8f6d-45ee-b7bd-2fe5297be84b]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4d005c17-fe3a-412a-afc3-63b3f60e39c8/9fd64b5f-8912-4aeb-bad2-c19439762f4d]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=wildfire/3684fa61-96a8-45ee-9e7f-145440df4cb8]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=aed5a6d8-85e7-4d78-9538-687f742ca6fd/d1d0a24a-3ba9-4f90-8a02-5771b307dfdf]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=comsvcauth/bc6f9edd-572f-44ec-bb1a-e41ff702c796]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9faf253e-fae8-4216-bba4-1290e0d9ab4d/e69f4a20-1de4-49a3-8765-d4c87e16e1e2]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=testing-nithin/171b32ec-2140-4afd-97b9-0dc2d0dc83a1]
module.keycloak_test.module.custom_realms.module.testing-nithin.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=525e4172-8bff-4053-b033-cfe7ee316011/fb9bb1d2-da8b-4954-939b-ea20287a6e65]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/99eae578-4821-4467-92c8-f6e6e32ef26a]
module.keycloak_test.module.custom_realms.module.comsvcauth.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=40b76289-36ba-4a72-9fcf-496bf41bff3f/3242c804-8d6a-42dc-843e-707b98b478aa]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=115c8a2a-7455-4eee-8783-701fec037123/450e3b37-f37d-4135-88ee-ad5e51d952e6]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/4de0278d-adda-492e-ab01-0c5fb20b20b6]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3a507fbf-fecf-419a-9f8f-5ed7dda65623/c59c025f-7acf-437f-8509-2860b9e9565c]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=servicebc/ecfaa4a8-dcc4-4183-9320-e842f47e7322]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=735df182-314e-4b0e-92c4-0a000a4c5383/faca6b6b-6fed-4120-abcb-50d7c9ae751b]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=wildfire/bc157790-cdf0-4531-88f2-de900dbfd209]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=da9c70c5-5753-4b44-ac0b-1c6b5e7eaad2/fddd0b31-1e13-47c3-9879-a0bd2d3d023c]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/db65b7fe-b068-41d4-8522-ad4ea9696c79]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/13d91391-3837-4ca2-8530-c4e0d010d72a]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=1f85e4b3-a0d8-4240-b653-f5faa8c26962/27cf1b3d-1f71-4909-82bb-171b92633d85]
module.keycloak_test.module.custom_realms.module.servicebc.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ef59198f-9490-4a98-a17e-5a549c66b1fc/e2ccb163-dc17-4b20-9072-9c0bb86d4bca]
module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=apigw/5e5ecd59-9158-4b5f-87b1-b44a93105883]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/52ac3287-9831-4a9b-97de-728fffd8423e]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=d347af39-24f8-4f3e-9349-9d27498d1e43/f9f62833-78e8-4fd6-a11e-6fef9b82d7d0]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/8b159479-9d4a-45c4-866b-e3c5954df474]
module.keycloak_test.module.custom_realms.module.wildfire.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=fd0cb4cb-2c9e-4f24-9911-47ed5215c767/2f7a9b6c-adce-4e6d-8211-e590f9af679d]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=3a7519a0-84c3-4611-aab1-9c9bba2a4ab7/c5cf923e-db7b-4d0d-8322-e24e3d751238]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/0a40bead-82aa-47c2-8486-54098e9a0833]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ebee7bf2-e2ae-43b3-b574-8ddaf0f1b867/97d2d307-1b12-4420-8a35-f5681968f64b]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/a138e9d4-ac6e-43eb-9651-efb5fcfc39ad]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=962e2c29-a3ad-450f-9392-279a72992b9c/d6ee60a1-9bfd-47c4-a174-ba39983a8e27]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/23a0f5df-48cc-4bfb-ae78-e2668f217ac5]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=c528613f-ff75-40b8-8a42-d96d90098614/c76bdd26-1598-4c3d-a245-c3823abfa025]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4809e1e3-b82e-4ae1-bb1f-9e57b07adcfa/ce4fb77f-4fd2-491a-8740-ac9b06a35d18]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=aestsims/69811bcd-f7aa-4a56-a3e6-368be1c3adcb]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=fb796deb-b237-41ef-b17b-51561c20e615/caccae3e-53bf-4da9-ab9d-8466eb711c06]
module.keycloak_test.module.custom_realms.module.bcregistry.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=bcregistry/2a396b75-4a8a-45e2-b219-eca91e1eec47]
module.keycloak_test.module.custom_realms.module.public-cloud.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=public-cloud/50917c96-aa7e-4b7d-bad3-86a8bcc767b0]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/deb7ed7c-1c5f-4aa2-81ea-04236695f97e]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=bb2b7c34-ae52-4b8d-bc80-ee26997f35b8/8783794f-b639-49c1-8837-38a81416f0de]
module.keycloak_test.module.custom_realms.module.aestsims.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=799dd412-5f82-40c5-a992-f2cad5df6115/d5584272-4381-41e2-8e8d-2083a9009bc6]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/80d7145f-eb5d-4ebf-8b43-2cbd2074e5dd]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/2fed04b2-f193-44bc-b1b6-032c15c44dfe]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0fcbc1cd-ed9b-461f-a15c-c7c51e5c97e4/fac44fa6-fa44-4b80-835a-235f7b0affca]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=hcap/1dd1c6e9-389f-4e85-9fb7-0a85862a7653]
module.keycloak_test.module.custom_realms.module.hcap.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=1aee7454-e379-4492-ba04-30c77579e8c0/2fc86238-bfbb-4060-ad6a-02af95e49252]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b0af1353-9fb7-4171-b8d9-b576fdbc0e91/4cefc1a3-bd71-450e-82d2-b815f775dff2]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/482a78c5-7a80-4b59-be9e-d2f272b86236]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=6b4fda8e-7f4f-4325-85cb-78aaddb8f8a7/4e3ca7a9-59b8-4b32-be46-2c29146390a2]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=eao-epic/c8f7631d-6fb1-402a-bc85-a49a0856c012]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=55dbcfd1-5a43-478a-8ba7-edfd995ec34c/c6a4d3e2-54ba-492d-be3f-b6e6932e5eaa]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/66f5d7a0-adaa-43ce-8173-af4108770b0d]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/fae6f9e1-5346-4be5-aeff-0d6becd059f3]
module.keycloak_test.module.custom_realms.module.eao-epic.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7581246a-f751-4121-ae92-83ac85de8c59/91cfb6f1-6a7c-4599-8f77-60bf6f7cbc15]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=digitaltrust-nrm/6a761779-7377-4e78-a057-01f9b44b7240]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=77cc30cb-cf99-46d7-8d9e-c1bf5f2db74b/ef805f74-d817-457d-b0c0-d22e5f8d8e3f]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=1666dc40-7065-4c0f-ba13-98de1f1eb4b6/40bfc0a2-382d-4d80-b55e-433c4718842e]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=health-gateway-gold/1bb766af-ba33-42e1-b77e-86e106fe664e]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/c4490e0a-9905-453a-99e9-c6bb2e5abf1d]
module.keycloak_test.module.custom_realms.module.digitaltrust-nrm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=595c3960-9f64-47ce-a69c-f809c50cff71/611351c6-f581-404e-8cf7-d1d0771e540a]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=63642419-f920-427e-8bd4-262ff0a81a88/f28dcb50-8466-4e51-842b-758aa63fedd9]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=health-gateway-gold/1a86ca4f-f32c-4a9e-95a8-b4d8d5904c94]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0d128fd8-3f02-4947-826a-d72e386220ce/01e5e86c-1735-480e-9b05-543de06b57b7]
module.keycloak_test.module.custom_realms.module.health-gateway-gold.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/ae1908c7-a671-4416-9dee-2da86feb005a]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/29f26753-9693-405f-aacb-36a46edd1b37]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0e09698f-621f-4f01-bbde-77cc2e1c3564/074a4c16-a842-41e2-8e2f-3e599ced3e2e]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f38ed335-e30f-44ff-a2aa-d4d11e407d22/3aa3c15f-f54f-4aa2-a03f-13c010bd36e5]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=platform-services/8803651d-b206-4072-91d4-f08985f6308d]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=platform-services/ecc7027d-75dc-4590-abfc-2363e868f812]
module.keycloak_test.module.custom_realms.module.platform-services.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=96c92a6b-9402-4cc0-85a3-462125817115/ec6290f9-a195-4ac9-8380-ee60ea462ca1]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/d16de720-e493-478f-8fca-5e44ed2ffcbf]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=0f04fe56-4a58-4f54-b6fd-bf336b4f5b7e/cfa0e462-eb9b-453c-9220-267b005da21a]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=d0d0faa0-9e61-4a00-abff-d82e75d4301c/772043f2-43a7-4fdd-befc-a8a9eb64a609]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/647faea0-2cad-4796-9284-42fa0a5e3de0]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=f57e6ddf-4865-484e-9185-55766f334183/cb245e74-5a1c-4a97-a226-82ad60848fa0]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/a1211069-cbda-4445-a94a-43a47b145770]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=chefs/5935cdbf-3fb4-4aa3-9694-3645de85c760]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=e3998991-2d29-44bf-aeff-e313c153505c/c42140cd-3925-4d14-a206-8201d17d1e3c]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/863fe369-4068-46b1-93ae-5cd13450b1d7]
module.keycloak_test.module.custom_realms.module.chefs.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=4ff7d650-f9c1-45cd-893e-684e17f03223/b7fe03eb-e723-45ec-843c-e53086c1eb90]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=zelda/a2cb44c8-9ef0-41d0-a7c5-872e9caee3d3]
module.keycloak_test.module.custom_realms.module.zelda.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=64ac0007-1016-4fc5-92da-e25cfe7529a0/f21a56df-c668-4ad5-8084-b533091876db]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_realms.module.servicebc.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "servicebc"
      ~ login_theme                              = "bcgov" -> "bcgov-idp-login-no-brand"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.workbces.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "workbces"
      ~ login_theme                              = "bcgov" -> "bcgov-idp-login-no-brand"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.platform-services.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "platform-services"
      ~ login_theme                              = "bcgov" -> "bcgov-idp-login"
        # (44 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.workbces.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "workbces"
      ~ login_theme                              = "bcgov-idp-stopper" -> "bcgov-idp-login-no-brand"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.workbces.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
        id                                       = "workbces"
      ~ login_theme                              = "bcgov-idp-stopper" -> "bcgov-idp-login-no-brand"
        # (42 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.custom_realms.module.tian-test-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "tian-test-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.custom_realms.module.tian-test-realm.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "tian-test-realm-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.tian-test-realm.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.tian-test-realm.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.tian-test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target```

</details>

*Pusher: @tzhang200, Action: `pull_request`*